---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.InvalidMaterialId
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.InvalidMaterialId

Element id used as material id does not correspond to an actual MaterialElem.